"""
Задание 6. Область видимости.

1. ДО запуска предскажи вывод scope_demo() и print(value) после вызова.
   Запиши ответ и объяснение в комментарии.
2. Запусти файл и сравни с прогнозом.
3. Объясни, почему локальная переменная не меняет глобальную.
4. Реализуй increase(value, step=1), возвращающую увеличенное значение.
   Не используй global и не изменяй глобальные переменные.
5. В main() сохрани результат increase в локальную переменную.
6. Объясни в комментарии, почему имя local_result недоступно
   за пределами main(). Не оставляй в файле вызов, вызывающий NameError.
"""

value = 10


def scope_demo() -> None:
    value = 20
    print("Внутри scope_demo:", value)


def increase(value: int, step: int = 1) -> int:
    return value+step


def main():
    scope_demo() # Значение будет 20, либо любым другим значением, которое будет внутри функции
    print("После scope_demo:", value) # Здесь будет глобальная, 10
    # https://docs.python.org/ru/3.14/tutorial/classes.html
    # В python, как и во многих других языках существуют пространства имён, которые хранят имена функций и объектов
    # Пространства имён изолируются благодаря области видимости. То есть, напрямую к ним обратиться не получится
    # (Хотя в теории обратиться всё-таки возможно). Всего есть 4 области видимости. Во время выполнения кода количество
    # может варьироваться от 3 до 4. Внутренняя область - содержит локальные имена, Область видимости любых внешних функций
    # (nonlocal) содержит все нелокальные и не глобальные имена, Область видимости всех глобальных имён в текущем модуле
    # И самая внешняя облатсь видимости, пространство имён с встроенными именами (len, max и тд)

    # Почему локальная переменная не меняет глобальную?
    # Потому что переменные находятся в разных областях видимости и пространствах имён. Но в теории глобальную переменную
    # Можно изменить объявив её с помощью global
    local_result = increase(value, step=5)
    print("Результат increase:", local_result)
    print("Глобальное значение:", value)
    # local_result недоступно за пределами основной функции из-за того что вне функции мы видим только глобальную
    # область и область с встроенными именами.

if __name__ == "__main__":
    main()
